#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_CONF/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/c0fe2e9f-6937-4ffa-9296-d786d9b0a98b/dcc3f917-a5aa-46f1-a7f7-3e9ed6e0e5ad]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_REV/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/20e896f4-bf43-43ed-9441-d166e0513f34/5438b8e8-4948-4446-a083-531ec9654913]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_IAT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/a837283e-f96e-446d-9c51-5ac7d0eab773/4e6fc50d-7fe8-4538-ac58-7871aea011b8]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_SIT/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/1197df69-9199-49a5-a49a-c7d43d35551c/9c02e9eb-e774-4a31-8e43-3e54a54ea88f]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_STG/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/2e161683-3c4d-4a2a-a86b-c83f2fe3e3d7/f692dc45-2411-41f7-ac95-da948714f1a7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.scope-mappings.keycloak_generic_client_role_mapper.SCOPE-MAPPING["PLR_FLVR/SECONDARY_SOURCE"]: Refreshing state... [id=moh_applications/client/a6111e23-097e-4f61-9c25-9343b0efd796/scope-mappings/ab63ae34-0fda-4f1b-ac8f-1380bea87f44/24124d3b-7a3e-4a8b-af90-47c03394b350]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_CONF/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/dcc3f917-a5aa-46f1-a7f7-3e9ed6e0e5ad]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_FLVR/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/24124d3b-7a3e-4a8b-af90-47c03394b350]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_SIT/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/9c02e9eb-e774-4a31-8e43-3e54a54ea88f]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_STG/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/f692dc45-2411-41f7-ac95-da948714f1a7]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_REV/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/5438b8e8-4948-4446-a083-531ec9654913]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_UAT/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/7da1617b-2d92-4c2c-8981-dd7151a76a85]
module.KEYCLOAK_TEST.module.moh_applications.module.PLR-PRIMARY-CARE.module.service-account-roles.keycloak_openid_client_service_account_role.ROLE["PLR_IAT/SECONDARY_SOURCE"]: Refreshing state... [id=29e820c6-284b-4209-ae0a-430c5033fd30/4e6fc50d-7fe8-4538-ac58-7871aea011b8]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/27967216-03f7-4259-b50a-955b995d51ad]
module.KEYCLOAK_DEV.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/053fa749-b569-4258-bc9e-bc8ca0541dfe]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-MIDTIER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/782fe94e-79a2-438f-9bc1-28717395b28d]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-AM-TEAM.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/eb2dce73-6fe7-4b63-8b7a-c5995a530714]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-QA.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/658f081c-a8b0-4c1b-b9ee-7e8901158ce7]
module.KEYCLOAK_TEST.module.moh_applications.module.CGI-DEVELOPER.keycloak_group_roles.GROUP_ROLES: Refreshing state... [id=moh_applications/ba2aead8-cd2d-4519-991b-3bd44c71c057]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-PRODUCTION.keycloak_generic_client_protocol_mapper.saml_hardcoded_attribute_mapper will be created
  + resource "keycloak_generic_client_protocol_mapper" "saml_hardcoded_attribute_mapper" {
      + client_id       = (known after apply)
      + config          = {
          + "attribute.name"       = "OrganizationName"
          + "attribute.nameformat" = "Basic"
          + "attribute.value"      = "hlbc-prod"
          + "friendly.name"        = "OrganizationName"
        }
      + id              = (known after apply)
      + name            = "OrganizationName"
      + protocol        = "saml"
      + protocol_mapper = "saml-hardcode-attribute-mapper"
      + realm_id        = "moh_applications"
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-PRODUCTION.keycloak_saml_client.CLIENT will be created
  + resource "keycloak_saml_client" "CLIENT" {
      + assertion_consumer_post_url         = "https://login.cac1.pure.cloud/saml"
      + assertion_consumer_redirect_url     = "https://login.cac1.pure.cloud/saml"
      + base_url                            = "https://apps.cac1.pure.cloud/"
      + canonicalization_method             = "EXCLUSIVE"
      + client_id                           = "GENESYS-PRODUCTION"
      + client_signature_required           = false
      + description                         = "Contact Center as a Service (CCaaS) Genesys CX Cloud contact center solution. Production environment. Temporarily connected to Keycloak Test instance."
      + enabled                             = true
      + encrypt_assertions                  = false
      + encryption_certificate              = (known after apply)
      + encryption_certificate_sha1         = (known after apply)
      + force_name_id_format                = false
      + force_post_binding                  = true
      + front_channel_logout                = true
      + full_scope_allowed                  = false
      + id                                  = (known after apply)
      + include_authn_statement             = true
      + login_theme                         = "idir_aad-phsa-bcprovider"
      + logout_service_post_binding_url     = "https://login.cac1.pure.cloud/saml/logout"
      + logout_service_redirect_binding_url = "https://login.cac1.pure.cloud/saml/logout"
      + name                                = "GENESYS PRODUCTION"
      + name_id_format                      = "persistent"
      + realm_id                            = "moh_applications"
      + sign_assertions                     = false
      + sign_documents                      = true
      + signature_algorithm                 = "RSA_SHA256"
      + signature_key_name                  = "NONE"
      + signing_certificate                 = (known after apply)
      + signing_certificate_sha1            = (known after apply)
      + signing_private_key                 = (known after apply)
      + signing_private_key_sha1            = (known after apply)
      + valid_redirect_uris                 = [
          + "https://apps.cac1.pure.cloud/*",
          + "https://login.cac1.pure.cloud/*",
        ]
    }

  # module.KEYCLOAK_TEST.module.moh_applications.module.GENESYS-PRODUCTION.keycloak_saml_user_attribute_protocol_mapper.saml_user_attribute_mapper will be created
  + resource "keycloak_saml_user_attribute_protocol_mapper" "saml_user_attribute_mapper" {
      + client_id                  = (known after apply)
      + friendly_name              = "email"
      + id                         = (known after apply)
      + name                       = "email"
      + realm_id                   = "moh_applications"
      + saml_attribute_name        = "email"
      + saml_attribute_name_format = "Basic"
      + user_attribute             = "email"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @filipflorek, Action: `pull_request`*